artillery.yml
config:
  target: "http://localhost:3000"
  phases:
    - duration: 30
      arrivalRate: 5
      name: "Warm up"

    - duration: 60
      arrivalRate: 5
      rampTo: 25
      name: "Ramp up"

    - duration: 120
      arrivalRate: 25
      name: "Sustained load"

    - duration: 60
      arrivalRate: 50
      name: "Peak load"

  processor: "./artillery-processor.js"

  defaults:
    headers:
      Content-Type: "application/json"

  plugins:
    expect: {}

scenarios:
  - name: "Browse and vote"
    weight: 70
    flow:
      - get:
          url: "/api/crews"
          expect:
            - statusCode: 200

      - think: 2

      - post:
          url: "/api/vote"
          beforeRequest: "injectVotePayload"
          json:
            crewId: "{{ crewId }}"
            fingerprint: "{{ fingerprint }}"
            artilleryToken: "{{ artilleryToken }}"
          expect:
            # 200 success
            # 409 duplicate vote (expected sometimes if fp repeats accidentally)
            # 403 if voting window closed (if you test strict mode)
            - statusCode: [200, 409, 403, 429]
      - post:
            url: "/api/vote/check"
            json:
              fingerprint: "{{ fingerprint }}"
            expect:
                - statusCode: 200


  - name: "Just browse (no vote)"
    weight: 30
    flow:
      - get:
          url: "/api/crews"
          expect:
            - statusCode: 200
      - think: 5